app/Controllers/Owner/DashboardManageController.php

    public function delete($id)
    {
        $applicationId = session()->get('application_id');

        $dashboard = $this->dashboardModel
            ->where('id', $id)
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->first();
---
SELECT *
FROM `dashboards`
WHERE `id` = '1'
AND `application_id` = '1'
AND `deleted_at` IS NULL
AND `dashboards`.`deleted_at` IS NULL
 LIMIT 1