app/Controllers/Owner/DashboardController.php

    public function index()
    {
        // Cek apakah user sudah login dan role owner
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai owner');
        }

        $userId = session()->get('user_id');
        $applicationId = session()->get('application_id');

        // Jika belum punya aplikasi, tampilkan dashboard dengan setup mode
        if (!$applicationId) {
            return $this->dashboardWithoutApplication();
        }

        // Ambil data aplikasi
        $application = $this->applicationModel->find($applicationId);

        if (!$application) {
            // Jika aplikasi tidak ditemukan, tampilkan dashboard dengan setup mode
            return $this->dashboardWithoutApplication();
        }

        // Hitung statistik overview
        $totalDatasets = $this->datasetModel
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->countAllResults();
---
SELECT *
FROM `applications`
WHERE `applications`.`id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `datasets`
WHERE `application_id` = '1'
AND `deleted_at` IS NULL
AND `datasets`.`deleted_at` IS NULL

            ->where('deleted_at', null)
            ->countAllResults();

        $totalDashboards = $this->dashboardModel
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->countAllResults();

        // Total rows dari semua dataset
        $totalDataRows = $this->datasetModel
            ->select('SUM(total_rows) as total')
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->where('upload_status', 'completed')
            ->first();

        // Dataset terbaru
        $recentDatasets = $this->datasetModel
            ->where('application_id', $applicationId)
            ->where('deleted_at', null)
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->find();
---
SELECT COUNT(*) AS `numrows`
FROM `dashboards`
WHERE `application_id` = '1'
AND `deleted_at` IS NULL
AND `dashboards`.`deleted_at` IS NULL
SELECT SUM(total_rows) as total
FROM `datasets`
WHERE `application_id` = '1'
AND `deleted_at` IS NULL
AND `upload_status` = 'completed'
AND `datasets`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `datasets`
WHERE `application_id` = '1'
AND `deleted_at` IS NULL
AND `datasets`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5

    private function getUploadTrend($applicationId, $days = 7)
    {
        $dates = [];
        $counts = [];

        for ($i = $days - 1; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $dates[] = date('d M', strtotime($date));

            $count = $this->datasetModel
                ->where('application_id', $applicationId)
                ->where('DATE(created_at)', $date)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `datasets`
WHERE `application_id` = '1'
AND DATE(created_at) = '2025-12-21'
AND `datasets`.`deleted_at` IS NULL