app/Controllers/Owner/SettingController.php

    public function index()
    {
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login');
        }

        $applicationId = session()->get('application_id');

        if (!$applicationId) {
            return redirect()->to('/owner/application/create');
        }

        $application = $this->applicationModel->find($applicationId);
---
SELECT *
FROM `applications`
WHERE `applications`.`id` = '1'