app/Controllers/Owner/StatisticController.php

    public function index()
    {
        // Cek login dan role
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai owner');
        }

        $applicationId = session()->get('application_id');

        if (!$applicationId) {
            return redirect()->to('/owner/application/create');
        }

        // Get all statistics
        $statistics = $this->statisticModel
            ->select('statistic_configs.*, datasets.dataset_name, users.nama_lengkap as creator_name')
            ->join('datasets', 'datasets.id = statistic_configs.dataset_id')
            ->join('users', 'users.id = statistic_configs.created_by')
            ->where('statistic_configs.application_id', $applicationId)
            ->where('statistic_configs.deleted_at', null)
            ->orderBy('statistic_configs.created_at', 'DESC')
            ->findAll();
---
SELECT `statistic_configs`.*, `datasets`.`dataset_name`, `users`.`nama_lengkap` as `creator_name`
FROM `statistic_configs`
JOIN `datasets` ON `datasets`.`id` = `statistic_configs`.`dataset_id`
JOIN `users` ON `users`.`id` = `statistic_configs`.`created_by`
WHERE `statistic_configs`.`application_id` = '1'
AND `statistic_configs`.`deleted_at` IS NULL
AND `statistic_configs`.`deleted_at` IS NULL
ORDER BY `statistic_configs`.`created_at` DESC