app/Controllers/Owner/UserManageController.php

SELECT `users`.`id`, `users`.`nama_lengkap`, `users`.`email`, `users`.`bidang`, `users`.`is_active`, `roles`.`role_name`, `roles`.`role_label`, `user_roles`.`created_at` as `joined_at`
FROM `user_roles`
JOIN `users` ON `users`.`id` = `user_roles`.`user_id`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `user_roles`.`application_id` = '1'
AND `users`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login');
        }

        $applicationId = session()->get('application_id');

        $users = $this->userRoleModel
            ->select('users.id, users.nama_lengkap, users.email, users.bidang, users.is_active,
                     roles.role_name, roles.role_label, user_roles.created_at as joined_at')
            ->join('users', 'users.id = user_roles.user_id')
            ->join('roles', 'roles.id = user_roles.role_id')
            ->where('user_roles.application_id', $applicationId)
            ->where('users.deleted_at', null)
            ->findAll();

SELECT *
FROM `roles`
WHERE `role_name` IN ('owner','viewer')
---
    public function invite()
    {
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login');
        }

        $roles = $this->roleModel
            ->whereIn('role_name', ['owner', 'viewer'])
            ->findAll();

SELECT *
FROM `users`
WHERE `email` = 'gilangrizkyramadhan34@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `user_roles`
WHERE `user_id` = '7'
AND `application_id` = '1'
 LIMIT 1
---
    public function sendInvite()
    {
        $rules = [
            'email' => 'required|valid_email',
            'role_id' => 'required|numeric'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        try {
            $email = $this->request->getPost('email');
            $roleId = $this->request->getPost('role_id');
            $applicationId = session()->get('application_id');

            // Cek apakah user sudah terdaftar
            $user = $this->userModel->where('email', $email)->first();

            if (!$user) {
                return redirect()->back()->withInput()
                    ->with('error', 'Email tidak terdaftar. User harus register terlebih dahulu.');
            }

            // Cek apakah sudah member
            $existingMember = $this->userRoleModel
                ->where('user_id', $user['id'])
                ->where('application_id', $applicationId)
                ->first();

INSERT INTO `user_roles` (`user_id`, `role_id`, `application_id`, `is_active`, `created_at`) VALUES ('7', '2', '1', 1, '2026-01-02 04:58:50')
---
            }

            // Add user ke workspace
            $this->userRoleModel->insert([
                'user_id' => $user['id'],
                'role_id' => $roleId,
                'application_id' => $applicationId,
                'is_active' => 1,
                'created_at' => date('Y-m-d H:i:s')
            ]);

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '6'
---
    public function manageRoles($userId)
    {
        if (!session()->get('logged_in') || session()->get('role_name') !== 'owner') {
            return redirect()->to('/login');
        }

        $applicationId = session()->get('application_id');

        $user = $this->userModel->find($userId);
        if (!$user) {
            return redirect()->to('/owner/users')->with('error', 'User tidak ditemukan');
        }

        $userRole = $this->userRoleModel
            ->where('user_id', $userId)
            ->where('application_id', $applicationId)
            ->first();

        if (!$userRole) {
            return redirect()->to('/owner/users')->with('error', 'User tidak ada di workspace ini');

SELECT *
FROM `user_roles`
WHERE `user_id` = '6'
AND `application_id` = '1'
 LIMIT 1
---
    public function updateRole($userId)
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setJSON(['error' => 'Invalid request']);
        }

        try {
            $roleId = $this->request->getPost('role_id');
            $applicationId = session()->get('application_id');

            $this->userRoleModel
                ->where('user_id', $userId)
                ->where('application_id', $applicationId)
                ->set(['role_id' => $roleId, 'updated_at' => date('Y-m-d H:i:s')])
                ->update();