app/Controllers/Auth/LoginController.php

    public function authenticate()
    {
        // Validasi input
        $rules = [
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'Email harus diisi',
                    'valid_email' => 'Email tidak valid'
                ]
            ],
            'password' => [
                'rules' => 'required|min_length[6]',
                'errors' => [
                    'required' => 'Password harus diisi',
                    'min_length' => 'Password minimal 6 karakter'
                ]
            ]
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $remember = $this->request->getPost('remember');

        // Cek user di database
        $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'superadmin@datastat.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

        }

        // Ambil role user
        $userRole = $this->userRoleModel
            ->select('user_roles.*, roles.role_name, roles.role_label, applications.id as app_id, applications.app_name, applications.app_slug')
            ->join('roles', 'roles.id = user_roles.role_id')
            ->join('applications', 'applications.id = user_roles.application_id', 'left')
            ->where('user_roles.user_id', $user['id'])
            ->where('user_roles.is_active', 1)
            ->first();
---
SELECT `user_roles`.*, `roles`.`role_name`, `roles`.`role_label`, `applications`.`id` as `app_id`, `applications`.`app_name`, `applications`.`app_slug`
FROM `user_roles`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
LEFT JOIN `applications` ON `applications`.`id` = `user_roles`.`application_id`
WHERE `user_roles`.`user_id` = '2'
AND `user_roles`.`is_active` = 1
 LIMIT 1

        }

        // Update last login
        $this->userModel->update($user['id'], [
            'last_login' => date('Y-m-d H:i:s')
        ]);
---
UPDATE `users` SET `last_login` = '2025-12-23 08:18:18'
WHERE `users`.`id` IN ('2')

    private function logActivity($activityType, $module, $description, $data = [])
    {
        $logData = [
            'user_id' => session()->get('user_id'),
            'application_id' => session()->get('application_id'),
            'activity_type' => $activityType,
            'module' => $module,
            'description' => $description,
            'ip_address' => $this->request->getIPAddress(),
            'user_agent' => $this->request->getUserAgent()->getAgentString(),
            'request_data' => json_encode($data)
        ];

        $db = \Config\Database::connect();
        $db->table('log_activities')->insert($logData);
---
INSERT INTO `log_activities` (`user_id`, `application_id`, `activity_type`, `module`, `description`, `ip_address`, `user_agent`, `request_data`) VALUES ('2', NULL, 'login', 'users', 'User berhasil login', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', '{\"email\":\"superadmin@datastat.com\",\"ip_address\":\"::1\"}')