app/Controllers/Superadmin/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `applications`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `datasets`
WHERE `deleted_at` IS NULL
AND `datasets`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE DATE(created_at) >= '2025-12-20'
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `applications`
WHERE `is_active` = 1
AND `deleted_at` IS NULL
SELECT `applications`.*, `users`.`nama_lengkap` as `owner_name`
FROM `applications`
JOIN `users` ON `users`.`id` = `applications`.`user_id`
WHERE `applications`.`deleted_at` IS NULL
ORDER BY `applications`.`created_at` DESC
 LIMIT 10
SELECT *
FROM `users`
WHERE `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 10
SELECT `log_activities`.*, `users`.`nama_lengkap`, `applications`.`app_name`
FROM `log_activities`
LEFT JOIN `users` ON `users`.`id` = `log_activities`.`user_id`
LEFT JOIN `applications` ON `applications`.`id` = `log_activities`.`application_id`
ORDER BY `log_activities`.`created_at` DESC
 LIMIT 20
---
    public function index()
    {
        // Cek apakah user sudah login dan role superadmin
        if (!session()->get('logged_in') || session()->get('role_name') !== 'superadmin') {
            return redirect()->to('/login')->with('error', 'Anda harus login sebagai superadmin');
        }

        // Overview statistik global
        $totalUsers = $this->userModel
            ->where('deleted_at', null)
            ->countAllResults();

        $totalApplications = $this->applicationModel
            ->where('deleted_at', null)
            ->countAllResults();

        $totalDatasets = $this->datasetModel
            ->where('deleted_at', null)
            ->countAllResults();

        $totalStatistics = $this->statisticModel
            ->where('deleted_at', null)
            ->countAllResults();

        // Users baru minggu ini
        $newUsersThisWeek = $this->userModel
            ->where('DATE(created_at) >=', date('Y-m-d', strtotime('-7 days')))
            ->where('deleted_at', null)
            ->countAllResults();

        // Aplikasi aktif
        $activeApplications = $this->applicationModel
            ->where('is_active', 1)
            ->where('deleted_at', null)
            ->countAllResults();

        // Aplikasi terbaru
        $recentApplications = $this->applicationModel
            ->select('applications.*, users.nama_lengkap as owner_name')
            ->join('users', 'users.id = applications.user_id')
            ->where('applications.deleted_at', null)
            ->orderBy('applications.created_at', 'DESC')
            ->limit(10)
            ->find();

        // Users terbaru
        $recentUsers = $this->userModel
            ->where('deleted_at', null)
            ->orderBy('created_at', 'DESC')
            ->limit(10)
            ->find();

        // Aktivitas terbaru (global)
        $recentActivities = $this->logModel
            ->select('log_activities.*, users.nama_lengkap, applications.app_name')
            ->join('users', 'users.id = log_activities.user_id', 'left')
            ->join('applications', 'applications.id = log_activities.application_id', 'left')
            ->orderBy('log_activities.created_at', 'DESC')
            ->limit(20)
            ->find();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE DATE(created_at) = '2025-11-28'
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
---
    private function getUserGrowthData($days = 30)
    {
        $dates = [];
        $counts = [];

        for ($i = $days - 1; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $dates[] = date('d M', strtotime($date));

            $count = $this->userModel
                ->where('DATE(created_at)', $date)
                ->where('deleted_at', null)
                ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `applications`
WHERE DATE(created_at) = '2025-11-28'
AND `deleted_at` IS NULL
---
    private function getApplicationGrowthData($days = 30)
    {
        $dates = [];
        $counts = [];

        for ($i = $days - 1; $i >= 0; $i--) {
            $date = date('Y-m-d', strtotime("-$i days"));
            $dates[] = date('d M', strtotime($date));

            $count = $this->applicationModel
                ->where('DATE(created_at)', $date)
                ->where('deleted_at', null)
                ->countAllResults();